# Подготовка: добавить по одной единице к обоим аргументам.
q0 1 -> q1 1 L
q0 * -> q1 * L
q1 λ -> q2 1 R
q2 1 -> q2 1 R
q2 * -> q3 * R
q3 1 -> q3 1 R
q3 = -> q4 1 R
q4 λ -> q5 = L
q5 1 -> q5 1 L
q5 * -> q6 * L
q6 1 -> q6 1 L
q6 λ -> q7 λ R

# Умножение: для каждой единицы первого аргумента копировать второй.
q7 X -> q7 X R
q7 1 -> q8 X R
q7 * -> q17 * L
q8 1 -> q8 1 R
q8 X -> q8 X R
q8 * -> q9 * R
q9 1 -> q10 Y R
q9 Y -> q9 Y R
q9 = -> q15 = L
q10 1 -> q10 1 R
q10 Y -> q10 Y R
q10 = -> q11 = R
q11 1 -> q11 1 R
q11 λ -> q12 1 L
q12 1 -> q12 1 L
q12 = -> q13 = L
q13 1 -> q13 1 L
q13 Y -> q14 1 R
q14 1 -> q10 Y R
q14 Y -> q14 Y R
q14 = -> q15 = L
q15 1 -> q15 1 L
q15 Y -> q15 1 L
q15 * -> q16 * L
q16 1 -> q16 1 L
q16 X -> q16 X L
q16 λ -> q7 λ R

# Очистка служебной части, после '=' остаётся унарный результат.
q17 X -> q17 X L
q17 1 -> q17 1 L
q17 λ -> q18 λ R
q18 X -> q18 λ R
q18 * -> q18 λ R
q18 1 -> q18 λ R
q18 = -> qz = E
